app/controllers/smart_point_controller.rb

  def index
    @sp = SmartPoint.all
---
SELECT `smart_points`.* FROM `smart_points`

 def show
 	@sp = SmartPoint.find_by(macaddress: params[:macaddress])
---
SELECT  "smart_points".* FROM "smart_points" WHERE "smart_points"."macaddress" = $1 LIMIT 1  [["macaddress", "1235"]]

 def create
    if SmartPoint.exists?(:macaddress => params[:macaddress])
      UserSmartPoint.create(:user_mac => params[:user_mac], :spoint_mac =>params[:macaddress], :date => DateTime.now)
---
SELECT  1 AS one FROM "smart_points" WHERE "smart_points"."macaddress" = $1 LIMIT 1  [["macaddress", "1235"]]
INSERT INTO "smart_points" ("macaddress", "name", "lat", "long", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["macaddress", "1235"], ["name", "Semaforo"], ["lat", "3322332"], ["long", "12331123"], ["created_at", "2016-12-04 22:55:18.367309"], ["updated_at", "2016-12-04 22:55:18.367309"]]