app/controllers/user_smart_points_controller.rb

  def index
    @user_smart_points = UserSmartPoint.all
---
SELECT `user_smart_points`.* FROM `user_smart_points`

  def maps
    if (User.exists?())
        user = User.first.macaddress
        @spmacs=UserSmartPoint.where(user_mac: user).collect{|x| x.spoint_mac}
        @points=SmartPoint.where(macaddress: @spmacs)
---
SELECT  1 AS one FROM "users" LIMIT 1
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` ASC LIMIT 1
SELECT "user_smart_points".* FROM "user_smart_points" WHERE "user_smart_points"."user_mac" = $1  [["user_mac", "'123'"]]
SELECT `smart_points`.* FROM `smart_points` WHERE `smart_points`.`macaddress` IN ('123123123', '48783924')

  def create
    @user_smart_point = UserSmartPoint.new(user_smart_point_params)

    respond_to do |format|
      if @user_smart_point.save
---
INSERT INTO `user_smart_points` (`user_mac`, `spoint_mac`, `date`, `created_at`, `updated_at`) VALUES ('865', '8586756', '2016-11-22 20:21:00', '2016-11-22 20:22:12', '2016-11-22 20:22:12')

    def set_user_smart_point
      @user_smart_point = UserSmartPoint.find(params[:id])
---
SELECT  `user_smart_points`.* FROM `user_smart_points` WHERE `user_smart_points`.`id` = 1 LIMIT 1