app/controllers/user_controller.rb

 def show
 	    @user = User.find_by(macaddress: params[:macaddress])
---
SELECT  "users".* FROM "users" WHERE "users"."macaddress" = $1 LIMIT 1  [["macaddress", "123"]]

 def create
    if User.exists?(:macaddress => params[:macaddress])
      render json: {'status': 'same'}
    else
       @user = User.new()
       @user.macaddress=params[:macaddress]
       if @user.save
---
SELECT  1 AS one FROM "users" WHERE "users"."macaddress" = $1 LIMIT 1  [["macaddress", "123"]]
INSERT INTO "users" ("macaddress", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["macaddress", "'123'"], ["created_at", "2016-12-03 22:27:19.390411"], ["updated_at", "2016-12-03 22:27:19.390411"]]